Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON ID>EN Romance Punch.tmx
Source language: id
Languages: en

source: ORANG TUANYA
en: parents won a

source: BILANG…
en: tell me...

source: INI NIH
en: here’s

source: MAKAN NIH!
en: Eat this!

source: KAMU
en: have you

source: KALI!
en: saying!

source: COBA SINI,
en: come

source: YANG HARUS
en: who need

source: MALAM YANG GAWAT
en: a chaotic night

source: GAK MENEPATI JANJI?!
en: can’t even fulfill his own promise?!

source: DIH, KAN GUA INGIN TAHU KABAR MEREKA!
en: I just want to know how they’re doing!

source: LUPA DIA?!
en: forgotten about him?!

source: APA MAKSUDNYA INI, MA?!
en: what’s the meaning of this, mom?!

source: JANGAN BELANJA
en: stay out of

source: WOI MISKIN, BACOT LU KANTIN SELATAN!!
en: shut up, you poor north canteen peasants!

source: MEREKA BERDUA
en: them off

source: TUTUT!
en: beep beep!

source: TAPI KALI INI
en: Only this time,

source: A… AKU…
en: I-I...

source: DIA
en: crap,

source: UNTUK HARI INI,
en: just for today...

source: SOAL ITU,
en: with that,

source: SEMUA SENANG PROMNYA BERHASIL…
en: everyone’s happy because the prom went well...

source: APA RENCANAMU?
en: now?

source: GUA BELI AJA
en: should buy this

source: AKU BAHKAN
en: I didn’t even

source: YA?
en: huh?

source: SUDAH SADAR?
en: awake!

source: GUA SANGAT MARAH SAMA APE YANG MENIMPA BONI, CUMA…
en: I’m really upset with what happened to boni...

source: APAAN, SIH?!
en: what are you doing?!

source: LANJUTKAN!!
en: do it!

source: BUKAN KARENA
en: because they hate

source: SEKOLAH
en: how’s

source: ATAU
en: Or

source: KUMOHON…
en: I beg you...

source: MAKIN
en: me

source: KEREN JUGA LU,
en: I didn’t know

source: BAWA
en: bring

source: HATI-HATI!
en: be careful!

source: HEI
en: You worthless

source: NAMUN SAAT AKU
en: However, when

source: AH…
en: to...

source: BERSAMA KITA SUDAH DATANG ANAK YANG DIGOSIPKAN SEBAGAI ANAK HARAMNYA!
en: we’re here today with the boy that many has suspected to be the president’s illegitimate son.

source: CUKUP!
en: that’s enough!

source: AKU PERCAYA
en: Hmm... i believe

source: MAKSUDNYA
en: Yeah,

source: SPESIAL
en: a

source: SORI GUA TELAT,
en: sorry, I’m late.

source: SIAPA YANG JAHAT
en: blaming

source: ATAU…
en: or...

source: DIA GAK MAU
en: He didn’t

source: SOAL ITU
en: about that...

source: WOI, TELAT LU!
en: hey, you’re late!

source: ACARANYA SUDAH SELESAI, MENDING KAMI GABUNG SENANG-SENANG DI DALAM KAYAK YANG LAIN…
en: the event is over, why don’t you head in and have some fun like the others...

source: JIKA IBUNYA SAJA
en: How could I possibly

source: ITU, KAMU PIKIR
en: you think

source: SYUTING PENYEBAB TAKUT ,
en: that they wanted to shoot a reality show,

source: GUA.
en: subordinate...

source: NAMBAH SATU!
en: has turned, huh?

source: JANGAN BIKIN
en: Don’t get all sentimental

source: AMA PUTRA!
en: here.

source: KONFRENSI PERS?!
en: a press conference?!

source: PUTRA.
en: put his paintings.

source: CIH, BIAR LU
en: tsk, you’re

source: GUNTING
en: I guess

source: SEJAUH INI…
en: to go this far...

source: SEPERTI INI…
en: minutes...

source: MASUK SEKOLAH.
en: to go back to school.

source: YA GAKPAPA DONG, BTW TERIMA KASIH KAMU UDAH PERCAYA SAMA AKU.
en: well, of course! by the way, thanks for trusting me.

source: SEPERTI DULU!
en: like how she used to be!

source: DAN SELURUH SISTIM
en: and the stupid

source: MEREKA?
en: them?

source: DENGAN CARA?
en: how?

source: GAK JELAS
en: odd stuff and

source: NGELIATIN
en: are you looking at me

source: SE-SEKOLAH
en: o-our

source: DENGRN MAMA DULU!
en: just listen to me first!

source: MASIH BELUM
en: could you

source: JADI, UNTUK MEMASTIKAN
en: so, as part

source: TENGKORAK BESI.
en: from the iron skull.

source: FLICK -MU BURUK
en: Your technique was horrible,

source: KAMU YAKIN GAK PERNAH LIHAT DIA?
en: are you sure you’ve never seen him?

source: LU KHAWATIR SAMA DIA?
en: are you worried about him?

source: SEREM…
en: people... I’ve got to hurry.

source: GAK USAH LAMA-LAMA DIMARI.
en: let’s not delay it any longer.

source: GIMANA DENGAN PANITIA PROM?
en: how about the committee?

source: DAN BAHKAN
en: and she’s

source: MEMBELI BIJI SPESIAL
en: special flick pieces

source: LU PIKIR
en: you think

source: BUKAN
en: don’t mind

source: SAMPAI JUMPA
en: I’ll see you two

source: GUA ADIRA.
en: I’m adira.

source: JADI SILAHKAN BEBERES SENDIRI!
en: you’d better clear this area by immediately!

source: GAK AKAN KALAH
en: let you roaches beat me

source: TAPI KOK, ABANG INI KOK, TERASA FAMILIAR, YA>
en: this geezer looks familiar...

source: PALING BERSALAH
en: one for

source: BAKAL SEPUAS INI
en: would

source: NGGAK LAH,
en: What?!

source: PAGAR AYU!!
en: that weak?!

source: NUDIST CLUB?!
en: the nudist club?!

source: GAK PULANG-PULANG.
en: they haven’t returned!

source: BACOT DAH!
en: Just shut up!

source: TANPA CELAH INI?!
en: beast?!

source: APAAN KAYAK
en: this

source: POSISI LU SEKARANG.
en: you can understand where you’re at right now, huh?!

source: GOSONG KEKURUNG
en: burned to crisp

source: LU SENDIRI
en: you’re not

source: SENJATA
en: your

source: WAW!!
en: wow!

source: GANTENGNYA!
en: he’s so handsome!

source: OH?
en: huh?

source: BISA MELINDUNGI
en: weak spots

source: MEREKA.
en: off.

source: DIIKAT?
en: all tied up?

source: KAMU LIHAT KAN
en: look

source: BERTENGKAR…
en: be fighting each other...

source: SUDAH HEBAT?!
en: better than me, huh?!

source: MENANTANGMU
en: challenge you

source: APA, LU?
en: you saying?

source: HAHA, KAMU KHAWATIR, YA?
en: haha... are you worried?

source: APA-APA.
en: it.

source: UPS, WALKIE TALKIE GUA KE MANA YA?
en: (incorrect segments, translation moved to the missing text sheet)

source: LEWAT!
en: through!

source: BERKAT
en: Thanks to

source: LU NGOMONGNYA
en: could you

source: BIASA.
en: to handle you guys.

source: AKHIRNYA DATANG!
en: you’re finally here!

source: NAKAL.
en: boys...

source: UDAH DI BATAS
en: I guess you’re already

source: SENDIRI,
en: he cut it himself,

source: GUA MINTA MAAF,
en: apologize about that.

source: CAKEP!
en: good one!

source: EMANGNYA KENAPA?
en: so what?

source: OH, IYA EL!
en: by the way, amel!

source: BRAK
en: Thud

source: DAN APAPUN YANG BAKAL TERJADI…
en: so if anything should happen...

source: PINGSAN!!
en: he’s out!

source: TERIMA KASIH
en: thanks

source: YANG LU KIRA!
en: you think, you know?!

source: LAWAN
en: are no match

source: PADAHAL GUA TAHU
en: even though I knew

source: INI YANG TER---
en: for putting your trust in me--

source: NINJA LAIN.
en: by another ninja.

source: SEKARANG.
en: for now...

source: SEMANGAT!!
en: up even more!

source: OMOMG-OMONG ANAK-ANAK YANG DI DALAM KENAPA GAK ADA KABAR?
en: anyway, why haven’t the boys inside given us any update?

source: GAK BISA
en: I need to use

source: SELAIN
en: except

source: ISTIRAHATLAH,
en: get some rest.

source: BHUAH!
en: Crap!

source: TAMPAR BIAR SADAR SAMA
en: need to knock some sense into you so that

source: SAMA PASPAMPRES
en: secret service agents

source: DIA GAK BAKAL
en: she wouldn’t blame you

source: SIAL,
en: Shoot,

source: YANG KULIHAT SEKILAS
en: her in that book

source: GUA MUNTAH…
en: with me...

source: BERKOMUNIKASI.
en: communicate.

source: SELAMA INI…
en: long...

source: HII!
en: eekk!!!

source: KAMU GILA?
en: are you serious?!

source: AKU…
en: I...

source: AH.
en: Oops,

source: YANG SEHARUSNYA
en: the person

source: YANG MARAH?
en: with you?

source: KELUARKAN!!
en: let it all out!

source: BODOH!!
en: you doofus!

source: SISANYA AKAN
en: I’ll take it

source: DASAR…
en: (incorrect segments, translation moved to the missing text sheet)

source: DIBAKAR...
en: done it now...

source: EH, MAKAN YUK!
en: hey, wanna eat something?

source: DASAR BROJEK GILA
en: what a mad driver.

source: SELURUH RENCANA MEREKA,
en: on their conversation

source: GUA LANGSUNG AJA…
en: so let’s just get to the point...

source: GA-
en: h-

source: MEL, KERJA MELULU, NIH MINUM DULU!
en: amel, loosen up a bit, have a sip!

source: BOCAH-BOCAH
en: You

source: SINI…?
en: you here?

source: YA, TENTU SAJA!
en: well, of course!

source: JADI…
en: so...

source: SERIUS AMAT SIH!!
en: why so serious?!

source: TAPI KARENA GUA
en: her if I hadn’t seen

source: PLAK
en: smack

source: MENCOBA LARI,
en: to run away,

source: DENGAN BLACK CAMPAIGN!
en: those black progandas!

source: BUKANNYA HARI INI
en: I thought amel

source: KALIAN
en: all of you

source: DUH, AKU KENAPA, YA?
en: (incorrect segments, translation moved to the missing text sheet)

source: DI DEPAN, SI
en: up front,

source: IH,
en: huh?!

source: PERGI SANA
en: ahead.

source: GRAP
en: grab

source: SHARK
en: blam

source: LU GAK ADA DI SANA?
en: if you’re not there?

source: KITA LARI!
en: let’s scram!

source: COWOK-COWOK ZAMAN SEKARANG PADA PLIN-PLAN, SIH!
en: boys nowadays are so wishy-washy!

source: JADI PENYERANGAN ITU BENAR...
en: The attack is real?!

source: KALIAN TERSERAH!
en: (incorrect segments, translation moved to the missing text sheet)

source: LEBIH
en: Umm...

source: KAMU KEMANA AJA,
en: where have

source: DI MATANYA,
en: her eyes.

source: MENGUCAPKAN
en: to say

source: LAGI…
en: forgot about it...

source: BUKAN BERARTI
en: but that doesn’t mean

source: KENAPE…
en: why...

source: SI BAROTO?
en: baroto’s trainer?

source: TAPI KALIAN
en: but I can’t let

source: BELUM JUGA
en: been here

source: KE LU….
en: a favor...

source: MAKSUDMU?
en: What are you saying?

source: KITA SUDAH BILANG TANGGAL 1 APRIL SEKOLAH INI BAKAL DISERANG!
en: we’ve told you that the school will be attacked on the 1st of april!

source: SAYA TIDAK KENAL
en: I’ve never met

source: DARI SEKOLAH…
en: here first...

source: KALIAN PIKIR KALIAN
en: you thought you were

source: MASIH JAUH?
en: quite far, no?

source: SELAMA DIA
en: as long as

source: AKU TIDAK PERCAYA PILAR BESI?
en: I don’t believe in the iron pillars?!

source: ANAK NAKAL
en: you look

source: TAPI…
en: but...

source: YANG BISA
en: can help

source: SELALU MENANTI
en: always looked forward

source: BWOSSS
en: shoot

source: MENYELAMATKAN
en: save

source: CEWEKNYA NARA KAN
en: Nara’s girlfriend

source: BISA LOLOS
en: you could get away

source: MAU BERES.
en: done here.

source: TERIMA KASIH!
en: thank you!

source: DIA PENDEK, DIA
en: he’s short,

source: KALAU UDAH BEGINI
en: I’m afraid

source: MAU URUSAN PRESIDEN AKU GAK PEDULI, MINGGIR!
en: do i look like i care about the president?! get out of my way!

source: SUDAH JAM 6 SORE, DAN RANGKAIAN ACARA SUDAH SELESAI SEMUA~!
en: (incorrect segments, translation moved to the missing text sheet)

source: KITA…
en: school...

source: SEKERAS
en: iron

source: NARA!!
en: down!

source: KITA GAK BAKAL
en: If we don’t work together,

source: SIALAN!
en: You bi-!

source: KOK.
en: you know...

source: LU BAKAL KESINI, KAN?
en: you’re coming, right?

source: MUNGKIN MEREKA
en: Maybe they’re

source: EH IYA, LU KAN PACARNYA GILING LIRIPI, YA?
en: ah, right, you like giling liripi, don’t you?

source: GUA HARUS BERANGKAT SEKARANG!
en: I have to go now!

source: SEMUANYA, KAN
en: of everything, right?

source: ITIK
en: duck

source: GAK SOPAN TAHU
en: where are your manners?!

source: B*NGS*T!!
en: scum!

source: HARUS DIJAGA?
en: your school?

source: KALAU ITU…
en: about that...

source: 21.H-1 PROM NIGHT
en: 21. PROM NIGHT D-1

source: MEL,
en: amel,

source: MENOLONGMU…
en: you...

source: IMIGRAN GELAP KALI
en: they decided to

source: BIARIN PERGI YA,
en: go for now,

source: TAMPAN DENGAN
en: for a handsome teenager,

source: CEWEKNYA,
en: his girlfriend,

source: HEI…
en: hey...

source: MENARA INI,
en: tower,

source: KELUAR DEH
en: he

source: DHAASH
en: whoosh

source: CIH…
en: tsk...

source: SERANG
en: let’s get

source: GAK MENGGANGGU
en: just in

source: SAMA DAMAR!
en: damar!

source: KAMI AKAN MEMPERTAHANKAN FROM INI!
en: we want this prom!

source: GAK ADA YANG BISA KAMU LAKUKAN SEKARANG…
en: there’s nothing you can do now...

source: HAHAHAHA!
en: hahaha!

source: LU BENCI BANGET
en: that you really hated

source: KAMU KENAL
en: You know

source: KAMU SUKA
en: you liked

source: "ORANG KAYA"
en: “a filthy rich person” falls

source: YA UDAH, AKU MAAFIN!
en: Fine, apology accepted!

source: DI RUMAH SAKIT JANGAN BERISIK!
en: you’re in a hospital, keep your voice down!

source: DIA DI MANA?
en: where he is?

source: AKU BISA MERASAKAN
en: I can feel that

source: TENANG,
en: calm down,

source: BERNAMA HIDUN, KITA BISA
en: called hidun, we managed

source: KENAPA…
en: why...

source: AKU PUN MAKIN DEKAT
en: I’ve gotten closer to

source: INI.
en: at this!

source: IYA JUGA, ANEH BANGET…
en: you’re right, it would be odd...

source: KALAU MENYANGKUT
en: when it comes to

source: MELEMPARNYA KE KAMU
en: over to you and let

source: KALAU ORANG
en: I guess that’s what

source: DIA SEDIH?
en: upset?

source: SEMUA SESUAI RENCANA.
en: everything is going according to plan.

source: BUKA JALAN!
en: make way!

source: DAN TERAKHIR NARA,
en: lastly, nara.

source: LUCU JUGA YA
en: funny

source: BERHASIL
en: have managed

source: INI ADA APA
en: what’s this

source: AKU MASIH INGIN
en: I still want

source: PERTAMA
en: first

source: MUSUH GUA!
en: my rival!

source: OH.
en: ah,

source: TAPI DARI TADI GAK BISA DIHUBUNGI!
en: Ugh... He’s not picking up!

source: BERES!
en: over!

source: DIA SUKA MENYENDIRI
en: comes here to calm his

source: KEMBALI KE SANA.
en: to that place the next day.

source: YANG LEBIH
en: be

source: NGERTI-NGERTI.
en: Okay, I understand.

source: DAN SEKARANG SKENARIO YANG TERJADI ADALAH PREDIKSI 99% DARI PERHITUNGAN GUA!
en: and I knew that this fight would 99% end like this.

source: SUDAH LAMA
en: has

source: MELIHAT TEKAD YANG KUAT
en: that fiery look on

source: RENCANAMU PASTI
en: it will

source: HEH!
en: hey!

source: BAROTO TIDAK TAKUT
en: baroto is ready to face

source: NAR--!!
en: go-!

source: WAH,
en: whoa,

source: GADIS YANG
en: what an interesting

source: LU MALAH MAU
en: you were there

source: KENAPA?!
en: why?!

source: BANYAK BELAJAR
en: to learn,

source: BERHENTI!
en: stop!

source: BEGO…
en: I’m such a fool...

source: DUA KALI, AKU TIDAK
en: out, kiddo. There’s no way

source: DRAGON DEN HIMITSU
en: Himitsu Dragon’s Lair...

source: KAMU PERCAYA AKU, KAN?
en: (incorrect segments, translation moved to the missing text sheet)

source: BEKERJA SAMA!
en: win!

source: AMEL PERGI NYUSUL
en: was going to france to meet

source: GAK BAIK
en: You people shouldn’t

source: BERITA SIMPANG SIUR
en: there has been

source: NAPAS!
en: to catch my breath!

source: SEKOLAH DAN MEMBUAT
en: burn down the school and

source: KESEMPATAN UNTUK
en: a chance

source: KAYAK GITU?
en: like that?

source: TAPI KOK---
en: but why--

source: DAN FAKTANYA
en: the truth is that

source: AKAN ADA SERANGAN.
en: the school would be attacked!

source: GIMANA
en: Hah!

source: KALAU BEGITU,
en: Well, then,

source: RIVAL ANTO BALOK
en: of anto.

source: KE LAUT!
en: Don’t know. Don’t care.

source: MENANG…
en: could turn this around...

source: DI SONO…
en: stay?

source: TES!
en: test!

source: LAGIAN MAKASIHNYA NANTI AJA WAKTU ACARANYA SELESAI.
en: thank me later when the event is over, okay?

source: BIAR KU TAHAN
en: I’ll hold them

source: ABIS DITOLONG
en: we can’t just leave him,

source: BUAH?
en: subordinate?

source: AKU TERNYATA TURUN
en: I’d arrived

source: SERING CERITA
en: me a lot

source: MELAWAN…
en: can do now...

source: TEBAK-TEBAKAN LUCU,
en: a silly question,

source: SEKARANG LO HARUS GUA APAIN…
en: (incorrect segments, translation moved to the missing text sheet)

source: KAMU MEMUTUSKAN
en: finally decided

source: LULUS!
en: did!

source: HAH,
en: huh,

source: APA BISA GUA TAHAN?
en: can I stop it?

source: MASIH MAU
en: still

source: GUA BISA
en: I need

source: DAN KALIAN SUDAH LIHAT DI SINI GUA DAN BINTANG UDAH NGASIH TANDA UNTUK POSISI MASING-MASING!
en: you can see that we have marked where each of you will be positioned!

source: TEX DALAM BAHAYA!
en: tex is in danger!

source: MEREKA
en: they

source: OH, SISWA?
en: huh, just some students.

source: CUMA--
en: be-?

source: AMEL TETAP AKAN KE PROM.
en: amel will still come to prom.

source: YAK, AMEL SAMA NIA
en: yup, amel and nia

source: KAMU GAK MAU
en: wouldn’t listen to

source: AKU AKAN MENANGANI INI
en: I’d deal with this problem

source: MENGALAHKAN
en: defeat

source: KAMU PIKIR
en: Ha! you thought

source: SAYA TIDAK KENAL,
en: have a child with this woman,

source: JUGA, YA…
en: alive...

source: HEI BOCAH,
en: Hey,

source: ADA ORANG?
en: someone’s here?

source: AKU KAN PANITIA HARUS DATANG LEBIH CEPAT!
en: I’m one of the committee, I need to get there earlier!

source: BAGAIMANA CARA
en: how can I

source: AKU DAN AMEL AKAN
en: will try

source: SIAL!
en: crap!

source: AKU GAK MABUK!
en: I’m not drunk!

source: BELAKANGKU.
en: behind me.

source: PAK!
en: sir.

source: GINI KALO GAK
en: to see a handsome boy

source: KATANYA CUMAN
en: she’s just going

source: HALO SEMUA, MOHON PERHATIANNYA!
en: hello, everyone, may I have your attention please!

source: APA YANG
en: what’s

source: MANTAN
en: an ex-iron pillar

source: NGAPAIN GUA
en: why am I

source: MONSTER
en: this

source: GUA CUMAN MAU
en: I just want to know

source: LU UTANG NYAWA KE DIA, GILIRAN DIA KAYAK GINI LO MANA?!
en: you owe him your life, are you just going to abandon him?!

source: MEMADAMKAN
en: to put out

source: MENERIMA TANTANGAN
en: I’d accept a challenge from

source: TIDAK LIHAT
en: see my

source: DATANG!
en: here!

source: TEX KARENA JADI BAND PENGISI BAKAL BERJAGA DI TENGAH!
en: since he’ll be performing during the prom, tex will guard the central area!

source: MACAM APA INI?!!
en: what’s with this power?!

source: YANG BANYAK,
en: you didn’t

source: SALAM KENAL,
en: How are you doing?

source: AW!!
en: Ouch!

source: BYUR~
en: slosh

source: SAMPAI SAAT INI, DENGAN INI AMEL,
en: With this, Amel,

source: AMIT-AMIT
en: there’s no way

source: BAU BENSIN,
en: smell

source: GUA GAK
en: I didn’t know

source: WAH, DIA AKHIRNYA MAU KETEMU AYAHNYA!
en: Whoa, he’s finally okay to see his father, I see.

source: SI DIAN MARAH HBANGET KAYAKNYA!
en: dian seems furious!

source: SUDAH SELAMA INI,
en: it’s been too long,

source: KARYANI UDAH
en: karyani has

source: OSIS TAK BERSALAH
en: an innocent student’s council president who’s

source: BENSIN?
en: Huh? Gasoline?

source: KE BELAKANG
en: in the

source: SESEORANG
en: she was supposed to be

source: DAN SEJAK DIUMUMKAN SOAL PROM, TAWURAN SEMAKIN BERKURANG, NAMUN SEBAGAI GANTINYA PARA COWOK-COWOK ITU SEMAKIN SERING MELIHAT CEWEK-CEWEK SECARA MENGERIKAN…
en: since the prom was announced, the number of brawls have been decreasing rapidly. Now, the boys are too busy prowling creepily for some girls...

source: "YANG GAK PILIH SAYA KALIAN CUPU"
en: “If you don’t vote for me, you suck!”

source: JELASKAN!
en: explain!

source: TUNG
en: clank

source: PENTING?
en: more important than this, right?!

source: ADALAH PEMBAKARAN
en: their main objective was to

source: JADI TRAINER
en: working as

source: LU BISA
en: you can

source: YA..
en: I guess,

source: 100 ORANG!
en: against a hundred of us!

source: KAYANYA PROM SUDAH SELESAI, YA?
en: the prom is over already?

source: INTINYA SEMUANYA HARUS DATANG TANGGAL 1 APRIL!
en: everyone must come on the 1st of April!

source: AH...
en: oh...

source: BERAKHIR!
en: over!

source: JADI KAMU GAK PERLU KE SEKOLAH DULU.
en: so, today, you don’t need to go to school.

source: JADI GUA
en: so, I just need

source: PUNCH S2
en: punch

source: FLICK ROYAL
en: national tournament

source: SIAPA BILANG
en: who says

source: NORMAL.
en: pretty cute.

source: UDAHAN?
en: already?

source: SI OM BOTAK LAGI
en: the bald geezer

source: MASALAH LU
en: what’s

source: TAPI GUA UDAH MENGHINDAR KARENA REFLEKS?
en: but I’ve already dodged out of reflex?

source: KAK DIAN, APA YANG KAKAK LAKUKAN?!
en: dian, what have you done?!

source: SEBELUM AKU DITANGKAP,
en: before I got caught,

source: SAMA PENDAPAT LU!
en: about your opinion!

source: WAHAHA AMEL MENGGILA!
en: (incorrect segments, translation moved to the missing text sheet)

source: SELAMA INI AKU SELALU MENCARUI TAHU ALASAN NARA DAN PUTRA BERANTEM, DAN DENGAN BANTUAN AMEL KITA BERHASIL MENGUMPULKAN MACAM-MACAM ALASAN...
en: for the longest time, I’ve been dying to know reason why nara and putra are fighting. with amel’s help, we’ve figured out a lot of theories...

source: BEBERAPA HARI LALU,
en: a few days ago.

source: PINTU!!
en: the exits!

source: DIBERI SEDIKIT
en: them a

source: RATUNYA!
en: their leader first!

source: CEWEK NAKAL!
en: a naughty girl!

source: SEMUA ITU GAK BERGUNA MELAWAN PRO KALKULASI 1% CRITICAL HIT SPEED AND POWER BALANCE DAMAGE!!
en: your power are useless against the master of critical hit, speed, and power balance!

source: EMANG
en: I guess

source: PI-PINTUNYA
en: th-the door...

source: SIAPA YANG BAIK,
en: each

source: SELAMA ADA NARA HARUSNYE MEREKA AMAN…
en: as long as nara’s there, they should be safe...

source: UNTUK KALIAN
en: present

source: YANG KUPIKIRKAN
en: what I was

source: AMEL DALAM
en: amel’s in

source: TELAT!!
en: very late!

source: DUA TITIK
en: at

source: KYAAAAA!!
en: kyaaa!

source: ASLINYA…
en: goes...

source: GAK AKAN TERJADI
en: has run

source: SAMPAI AMEL DAN
en: amel and nia

source: DIAN UDAH MAU KASIH TAHU, TAPI KUTOLAK.
en: dian was about to tell me everything, but I refused.

source: DI PIKIRAN GUA…
en: been on my mind...

source: UDAH KU LUPAIN?
en: I’ve forgotten about it?

source: KEMBALI UNTUK
en: he’s come

source: SANTAI!
en: (incorrect segments, translation moved to the missing text sheet)

source: DIA MASIH
en: Is he still

source: BERLINDUNGLAH DI
en: get

source: JATI, APA RENCANANYA SEKARANG?
en: jati, what’s our plan now?

source: GAK ADA
en: this

source: BIAR GUA
en: I’ll be the one

source: NGGAK, AKU KEDINGINAN AJA, KALI…
en: nah, I’m just cold...

source: NA-
en: n-

source: LIHAT, DIA UDAH KE SINI!
en: see, he’s here already!

source: NGESELIN,
en: Ugh!

source: PADAHAL
en: Hey!

source: MENDENGARKANNYA?!
en: still want to hear her out?

source: BUKAN WAKTUNYA
en: now’s not a good time,

source: YANG HARUS TAKUT
en: should be afraid

source: EMANG GUA NANYA
en: could you please

source: SENDIRI!
en: “family business”!

source: KAMU…
en: you’re...

source: JADI INI
en: so this is

source: EH, NARA!
en: nara!

source: AKU INGIN
en: call

source: TERUS SEKARANG TIBA-TIBA DIA NGAJAK MAKAN, KOK MAMA MAU-MAU AJA?!
en: and now you want us to have lunch with him?! what’s wrong with you?!

source: LAGI, YA.
en: again?

source: PERHATIAN
en: to see the boys,

source: KALIAN!
en: are dead!

source: KAMU TEMANNYA, KAN?
en: you’re her friend, right?

source: PAK JARED, KAN!
en: right?

source: DAN… BIAR SERU AJA, SIH!
en: and... I honestly just thought that it’d be fun!

source: PILAR BESI?
en: or

source: ATAS KEJADIAN
en: for what happened

source: AKU BISA
en: I can

source: IYA
en: yes,

source: BOSEN AJA.
en: bored.

source: CEPET JUGA…
en: that was pretty quick...

source: JADI
en: you’re

source: GARA-GARA
en: The prom was a bust

source: KAN KAMU YANG CERITA!
en: you told me about it!

source: ATAU OSIS YANG SELALU
en: the student’s council president

source: LAGIAN AKU HARUS KE SEKOLAH, ADA URUSAN YANG LEBIH PENTING!
en: besides, I need to go to school, I’ve got some business to attend to.

source: GENERASI
en: the first

source: KALAU ADA YANG GAK DATANG…
en: if any of you doesn’t show up...

source: MALAS
en: I don’t want

source: UDAH BANGKRUT.
en: no longer in business now.

source: SEKARANG JUGA, KITA SELESAIIN DI LAPANGAN MACHO!
en: let’s finish this at macho field!

source: AKU BERUSAHA
en: I’ll try to

source: RAKYATNYA…
en: my people...

source: NYALI PETARUNG
en: you’re
